{
  "id": "c835caba-0262-4f2a-9f6e-5ae43ce5264e",
  "name": "BruteForce",
  "description": "BruteForce-Attack",
  "tags": [
    "BruteForce Windows RDP EventID:4625"
  ],
  "type": "query",
  "language": "kuery",
  "query": "event.code: \"4625\"",
  "index": [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*"
  ],
  "interval": "5m",
  "enabled": true,
  "risk_score": 73,
  "severity": "high",
  "from": "now-6m",
  "to": "now",
  "max_signals": 100,
  "false_positives": [
    "-User mistyped password multiple times",
    "-Legitimate administrative RDP access during off-hours"
  ],
  "note": "1. Check source IP for signs of brute-force (multiple 4625s).\n2.Correlate with 4624 (successful logon) from same IP.\n3.Look for patterns or anomalies in logon attempts.\n4.Consider blocking IP or isolating host if threat confirmed.\n",
  "setup": "1. Make sure Winlogbeat is installed and configured to send logs to Elasticsearch.\n2. Sysmon or Windows Event Logging must be enabled.\n3. Confirm Event ID 4625 logs are being received from host(s).\n",
  "meta": {
    "kibana_siem_app_url": "http://192.168.27.224:5601/app/security"
  },
  "investigation_fields": {
    "field_names": [
      "source.ip",
      "user.name",
      "host.name"
    ]
  },
  "author": [
    "Mostafa Essam-0xMOSTA"
  ],
  "rule_id": "8ef196a3-9733-47a7-95cc-123b11c8ad6d",
  "version": 1,
  "immutable": false,
  "revision": 0,
  "created_at": "2025-05-18T03:16:11.313Z",
  "created_by": "elastic",
  "updated_at": "2025-05-18T03:16:25.372Z",
  "updated_by": "elastic",
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1110",
          "name": "Brute Force",
          "reference": "https://attack.mitre.org/techniques/T1110/",
          "subtechnique": []
        }
      ]
    }
  ],
  "references": [
    "https://attack.mitre.org/techniques/T1110/"
  ],
  "alert_suppression": {
    "group_by": [
      "source.ip"
    ],
    "duration": {
      "value": 5,
      "unit": "m"
    },
    "missing_fields_strategy": "suppress"
  },
  "filters": [],
  "risk_score_mapping": [],
  "severity_mapping": [],
  "exceptions_list": [],
  "required_fields": [],
  "related_integrations": [],
  "output_index": "",
  "license": "",
  "rule_source": {
    "type": "internal"
  },
  "actions": []
}
